{
    'time': 'Morning',
    'day': '1',
    'month': 'January',
    'scripture': 'They did eat of the fruit of the land of Canaan that year.',
    'book': 'Joshua',
    'chapter': '5',
    'verse': '12',
    'content': 'Israel\'s weary wanderings were all over, and the promised rest was attained. No more moving tents, fiery serpents, fierce Amalekites, and howling wildernesses: they came to the land which flowed with milk and honey, and they ate the old corn of the land. Perhaps this year, beloved Christian reader, this may be thy case or mine. Joyful is the prospect, and if faith be in active exercise, it will yield unalloyed delight. To be with Jesus in the rest which remaineth for the people of God, is a cheering hope indeed, and to expect this glory so soon is a double bliss. Unbelief shudders at the Jordan which still rolls between us and the goodly land, but let us rest assured that we have already experienced more ills than death at its worst can cause us. Let us banish every fearful thought, and rejoice with exceeding great joy, in the prospect that this year we shall begin to be "forever with the Lord."\n\nA part of the host will this year tarry on earth, to do service for their Lord. If this should fall to our lot, there is no reason why the New Year\'s text should not still be true. "We who have believed do enter into rest." The Holy Spirit is the earnest of our inheritance; he gives us "glory begun below." In heaven they are secure, and so are we preserved in Christ Jesus; there they triumph over their enemies, and we have victories too. Celestial spirits enjoy communion with their Lord, and this is not denied to us; they rest in his love, and we have perfect peace in him: they hymn his praise, and it is our privilege to bless him too. We will this year gather celestial fruits on earthly ground, where faith and hope have made the desert like the garden of the Lord. Man did eat angels\' food of old, and why not now? O for grace to feed on Jesus, and so to eat of the fruit of the land of Canaan this year!'
},
{
    'time': 'Evening',
    'day': '1',
    'month': 'January',
    'scripture': 'We will be glad and rejoice in thee.',
    'book': 'Song of Solomon',
    'chapter': '1',
    'verse': '4',
    'content': 'We will be glad and rejoice in thee. We will not open the gates of the year to the dolorous notes of the sackbut, but to the sweet strains of the harp of joy, and the high sounding cymbals of gladness. "O come, let us sing unto the Lord: let us make a joyful noise unto the rock of our salvation." We, the called and faithful and chosen, we will drive away our griefs, and set up our banners of confidence in the name of God. Let others lament over their troubles, we who have the sweetening tree to cast into Marah\'s bitter pool, with joy will magnify the Lord. Eternal Spirit, our effectual Comforter, we who are the temples in which thou dwellest, will never cease from adoring and blessing the name of Jesus. We will, we are resolved about it, Jesus must have the crown of our heart\'s delight; we will not dishonour our Bridegroom by mourning in his presence. We are ordained to be the minstrels of the skies, let us rehearse our everlasting anthem before we sing it in the halls of the New Jerusalem. We will be glad and rejoice: two words with one sense, double joy, blessedness upon blessedness. Need there be any limit to our rejoicing in the Lord even now? Do not men of grace find their Lord to be camphire and spikenard, calamus and cinnamon even now, and what better fragrance have they in heaven itself? We will be glad and rejoice in Thee. That last word is the meat in the dish, the kernel of the nut, the soul of the text. What heavens are laid up in Jesus! What rivers of infinite bliss have their source, aye, and every drop of their fulness in him! Since, O sweet Lord Jesus, thou art the present portion of thy people, favour us this year with such a sense of thy preciousness, that from its first to its last day we may be glad and rejoice in thee. Let January open with joy in the Lord, and December close with gladness in Jesus. '
},
{
    'time': 'Morning',
    'day': '2',
    'month': 'January',
    'scripture': 'Continue in prayer.',
    'book': 'Colossians',
    'chapter': '4',
    'verse': '2',
    'content': 'It is interesting to remark how large a portion of Sacred Writ is occupied with the subject of prayer, either in furnishing examples, enforcing precepts, or pronouncing promises. We scarcely open the Bible before we read, "Then began men to call upon the name of the Lord;" and just as we are about to close the volume, the "Amen" of an earnest supplication meets our ear. Instances are plentiful. Here we find a wrestling Jacob--there a Daniel who prayed three times a day--and a David who with all his heart called upon his God. On the mountain we see Elias; in the dungeon Paul and Silas. We have multitudes of commands, and myriads of promises. What does this teach us, but the sacred importance and necessity of prayer? We may be certain that whatever God has made prominent in his Word, he intended to be conspicuous in our lives. If he has said much about prayer, it is because he knows we have much need of it. So deep are our necessities, that until we are in heaven we must not cease to pray. Dost thou want nothing? Then, I fear thou dost not know thy poverty. Hast thou no mercy to ask of God? Then, may the Lord\'s mercy show thee thy misery! A prayerless soul is a Christless soul. Prayer is the lisping of the believing infant, the shout of the fighting believer, the requiem of the dying saint falling asleep in Jesus. It is the breath, the watchword, the comfort, the strength, the honour of a Christian. If thou be a child of God, thou wilt seek thy Father\'s face, and live in thy Father\'s love. Pray that this year thou mayst be holy, humble, zealous, and patient; have closer communion with Christ, and enter oftener into the banqueting-house of his love. Pray that thou mayst be an example and a blessing unto others, and that thou mayst live more to the glory of thy Master. The motto for this year must be, "Continue in prayer."'
},
{
    'time': 'Evening',
    'day': '2',
    'month': 'January',
    'scripture': 'Let the people renew their strength.',
    'book': 'Isaiah',
    'chapter': '41',
    'verse': '1',
    'content': 'All things on earth need to be renewed. No created thing continueth by itself. "Thou renewest the face of the year," was the Psalmist\'s utterance. Even the trees, which wear not themselves with care, nor shorten their lives with labour, must drink of the rain of heaven and suck from the hidden treasures of the soil. The cedars of Lebanon, which God has planted, only live because day by day they are full of sap fresh drawn from the earth. Neither can man\'s life be sustained without renewal from God. As it is necessary to repair the waste of the body by the frequent meal, so we must repair the waste of the soul by feeding upon the Book of God, or by listening to the preached Word, or by the soul-fattening table of the ordinances. How depressed are our graces when means are neglected! What poor starvelings some saints are who live without the diligent use of the Word of God and secret prayer! If our piety can live without God it is not of divine creating; it is but a dream; for if God had begotten it, it would wait upon him as the flowers wait upon the dew. Without constant restoration we are not ready for the perpetual assaults of hell, or the stern afflictions of heaven, or even for the strifes within. When the whirlwind shall be loosed, woe to the tree that hath not sucked up fresh sap, and grasped the rock with many intertwisted roots. When tempests arise, woe to the mariners that have not strengthened their mast, nor cast their anchor, nor sought the haven. If we suffer the good to grow weaker, the evil will surely gather strength and struggle desperately for the mastery over us; and so, perhaps, a painful desolation, and a lamentable disgrace may follow. Let us draw near to the footstool of divine mercy in humble entreaty, and we shall realize the fulfilment of the promise, "They that wait on the Lord shall renew their strengt."'
},
{
    'time': 'Morning',
    'day': '3',
    'month': 'January',
    'scripture': 'I will give thee for a covenant of the people.',
    'book': 'Isaiah',
    'chapter': '49',
    'verse': '8',
    'content': 'Jesus Christ is himself the sum and substance of the covenant, and as one of its gifts. He is the property of every believer. Believer, canst thou estimate what thou hast gotten in Christ? "In him dwelleth all the fulness of the Godhead bodily." Consider that word "God" and its infinity, and then meditate upon "perfect man" and all his beauty; for all that Christ, as God and man, ever had, or can have, is thine--out of pure free favour, passed over to thee to be thine entailed property forever. Our blessed Jesus, as God, is omniscient, omnipresent, omnipotent. Will it not console you to know that all these great and glorious attributes are altogether yours? Has he power? That power is yours to support and strengthen you, to overcome your enemies, and to preserve you even to the end. Has he love? Well, there is not a drop of love in his heart which is not yours; you may dive into the immense ocean of his love, and you may say of it all, "It is mine." Hath he justice? It may seem a stern attribute, but even that is yours, for he will by his justice see to it that all which is promised to you in the covenant of grace shall be most certainly secured to you. And all that he has as perfect man is yours. As a perfect man the Father\'s delight was upon him. He stood accepted by the Most High. O believer, God\'s acceptance of Christ is thine acceptance; for knowest thou not that the love which the Father set on a perfect Christ, he sets on thee now? For all that Christ did is thine. That perfect righteousness which Jesus wrought out, when through his stainless life he kept the law and made it honourable, is thine, and is imputed to thee. Christ is in the covenant.\n\n"My God, I am thine--what a comfort divine!\nWhat a blessing to know that the Saviour is mine!\nIn the heavenly Lamb thrice happy I am,\n\nAnd my heart it doth dance at the sound of his name."'
},
{
    'time': 'Evening',
    'day': '3',
    'month': 'January',
    'scripture': 'The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.',
    'book': 'Luke',
    'chapter': '3',
    'verse': '4',
    'content': 'The voice crying in the wilderness demanded a way for the Lord, a way prepared, and a way prepared in the wilderness. I would be attentive to the Master\'s proclamation, and give him a road into my heart, cast up by gracious operations, through the desert of my nature. The four directions in the text must have my serious attention.\nEvery valley must be exalted. Low and grovelling thoughts of God must be given up; doubting and despairing must be removed; and self-seeking and carnal delights must be forsaken. Across these deep valleys a glorious causeway of grace must be raised.\nEvery mountain and hill shall be laid low. Proud creature-sufficiency, and boastful self-righteousness, must be levelled, to make a highway for the King of kings. Divine fellowship is never vouchsafed to haughty, highminded sinners. The Lord hath respect unto the lowly, and visits the contrite in heart, but the lofty are an abomination unto him. My soul, beseech the Holy Spirit to set thee right in this respect.\nThe crooked shall be made straight. The wavering heart must have a straight path of decision for God and holiness marked out for it. Double-minded men are strangers to the God of truth. My soul, take heed that thou be in all things honest and true, as in the sight of the heart-searching God.\nThe rough places shall be made smooth. Stumbling-blocks of sin must be removed, and thorns and briers of rebellion must be uprooted. So great a visitor must not find miry ways and stony places when he comes to honour his favoured ones with his company. Oh that this evening the Lord may find in my heart a highway made ready by his grace, that he may make a triumphal progress through the utmost bounds of my soul, from the beginning of this year even to the end of it. '
},
{
    'time': 'Morning',
    'day': '4',
    'month': 'January',
    'scripture': 'Grow in grace, and in the knowledge of our Lord and Saviour Jesus Christ.',
    'book': '2 Peter',
    'chapter': '3',
    'verse': '18',
    'content': '"Grow in grace"--not in one grace only, but in all grace. Grow in that root-grace, faith. Believe the promises more firmly than you have done. Let faith increase in fulness, constancy, simplicity. Grow also in love. Ask that your love may become extended, more intense, more practical, influencing every thought, word, and deed. Grow likewise in humility. Seek to lie very low, and know more of your own nothingness. As you grow downward in humility, seek also to grow upward--having nearer approaches to God in prayer and more intimate fellowship with Jesus. May God the Holy Spirit enable you to "grow in the knowledge of our Lord and Saviour." He who grows not in the knowledge of Jesus, refuses to be blessed. To know him is "life eternal," and to advance in the knowledge of him is to increase in happiness. He who does not long to know more of Christ, knows nothing of him yet. Whoever hath sipped this wine will thirst for more, for although Christ doth satisfy, yet it is such a satisfaction, that the appetite is not cloyed, but whetted. If you know the love of Jesus--as the hart panteth for the water-brooks, so will you pant after deeper draughts of his love. If you do not desire to know him better, then you love him not, for love always cries, "Nearer, nearer." Absence from Christ is hell; but the presence of Jesus is heaven. Rest not then content without an increasing acquaintance with Jesus. Seek to know more of him in his divine nature, in his human relationship, in his finished work, in his death, in his resurrection, in his present glorious intercession, and in his future royal advent. Abide hard by the Cross, and search the mystery of his wounds. An increase of love to Jesus, and a more perfect apprehension of his love to us is one of the best tests of growth in grace. '
},
{
    'time': 'Evening',
    'day': '4',
    'month': 'January',
    'scripture': 'And Joseph knew his brethren, but they knew not him.',
    'book': 'Genesis',
    'chapter': '42',
    'verse': '8',
    'content': 'This morning our desires went forth for growth in our acquaintance with the Lord Jesus; it may be well tonight to consider a kindred topic, namely, our heavenly Joseph\'s knowledge of us. This was most blessedly perfect long before we had the slightest knowledge of him. "His eyes beheld our substance, yet being imperfect, and in his book all our members were written, when as yet there was none of them." Before we had a being in the world we had a being in his heart. When we were enemies to him, he knew us, our misery, our madness, and our wickedness. When we wept bitterly in despairing repentance, and viewed him only as a judge and a ruler, he viewed us as his brethren well beloved, and his bowels yearned towards us. He never mistook his chosen, but always beheld them as objects of his infinite affection. "The Lord knoweth them that are his," is as true of the prodigals who are feeding swine as of the children who sit at the table.\n\nBut, alas! we knew not our royal Brother, and out of this ignorance grew a host of sins. We withheld our hearts from him, and allowed him no entrance to our love. We mistrusted him, and gave no credit to his words. We rebelled against him, and paid him no loving homage. The Sun of Righteousness shone forth, and we could not see him. Heaven came down to earth, and earth perceived it not. Let God be praised, those days are over with us; yet even now it is but little that we know of Jesus compared with what he knows of us. We have but begun to study him, but he knoweth us altogether. It is a blessed circumstance that the ignorance is not on his side, for then it would be a hopeless case for us. He will not say to us, "I never knew you," but he will confess our names in the day of his appearing, and meanwhile will manifest himself to us as he doth not unto the world. '
},
{
    'time': 'Morning',
    'day': '5',
    'month': 'January',
    'scripture': 'And God saw the light, that it was good: and God divided the light from the darkness.',
    'book': 'Genesis',
    'chapter': '1',
    'verse': '4',
    'content': 'Light might well be good since it sprang from that fiat of goodness, "Let there be light." We who enjoy it should be more grateful for it than we are, and see more of God in it and by it. Light physical is said by Solomon to be sweet, but gospel light is infinitely more precious, for it reveals eternal things, and ministers to our immortal natures. When the Holy Spirit gives us spiritual light, and opens our eyes to behold the glory of God in the face of Jesus Christ, we behold sin in its true colours, and ourselves in our real position; we see the Most Holy God as he reveals himself, the plan of mercy as he propounds it, and the world to come as the Word describes it. Spiritual light has many beams and prismatic colours, but whether they be knowledge, joy, holiness, or life, all are divinely good. If the light received be thus good, what must the essential light be, and how glorious must be the place where he reveals himself. O Lord, since light is so good, give us more of it, and more of thyself, the true light.\n\nNo sooner is there a good thing in the world, than a division is necessary. Light and darkness have no communion; God has divided them, let us not confound them. Sons of light must not have fellowship with deeds, doctrines, or deceits of darkness. The children of the day must be sober, honest, and bold in their Lord\'s work, leaving the works of darkness to those who shall dwell in it forever. Our Churches should by discipline divide the light from the darkness, and we should by our distinct separation from the world do the same. In judgment, in action, in hearing, in teaching, in association, we must discern between the precious and the vile, and maintain the great distinction which the Lord made upon the world\'s first day. O Lord Jesus, be thou our light throughout the whole of this day, for thy light is the light of men. '
},
{
    'time': 'Evening',
    'day': '5',
    'month': 'January',
    'scripture': 'And God saw the light.',
    'book': 'Genesis',
    'chapter': '1',
    'verse': '4',
    'content': 'This morning we noticed the goodness of the light, and the Lord\'s dividing it from the darkness, we now note the special eye which the Lord had for the light. "God saw the light"--he looked at it with complacency, gazed upon it with pleasure, saw that it "was good." If the Lord has given you light, dear reader, he looks on that light with peculiar interest; for not only is it dear to him as his own handiwork, but because it is like himself, for "He is light." Pleasant it is to the believer to know that God\'s eye is thus tenderly observant of that work of grace which he has begun. He never loses sight of the treasure which he has placed in our earthen vessels. Sometimes we cannot see the light, but God always sees the light, and that is much better than our seeing it. Better for the judge to see my innocence than for me to think I see it. It is very comfortable for me to know that I am one of God\'s people--but whether I know it or not, if the Lord knows it, I am still safe. This is the foundation, "The Lord knoweth them that are his." You may be sighing and groaning because of inbred sin, and mourning over your darkness, yet the Lord sees "light" in your heart, for he has put it there, and all the cloudiness and gloom of your soul cannot conceal your light from his gracious eye. You may have sunk low in despondency, and even despair; but if your soul has any longing towards Christ, and if you are seeking to rest in his finished work, God sees the "light." He not only sees it, but he also preserves it in you. "I, the Lord, do keep it." This is a precious thought to those who, after anxious watching and guarding of themselves, feel their own powerlessness to do so. The light thus preserved by his grace, he will one day develop into the splendour of noonday, and the fulness of glory. The light within is the dawn of the eternal day. '
},
{
    'time': 'Morning',
    'day': '6',
    'month': 'January',
    'scripture': 'Casting all your care upon him; for he careth for you.',
    'book': '1 Peter',
    'chapter': '5',
    'verse': '7',
    'content': 'It is a happy way of soothing sorrow when we can feel--"HE careth for me." Christian! do not dishonour religion by always wearing a brow of care; come, cast your burden upon your Lord. You are staggering beneath a weight which your Father would not feel. What seems to you a crushing burden, would be to him but as the small dust of the balance. Nothing is so sweet as to\n "Lie passive in God\'s hands,\nAnd know no will but his."\n\nO child of suffering, be thou patient; God has not passed thee over in his providence. He who is the feeder of sparrows, will also furnish you with what you need. Sit not down in despair; hope on, hope ever. Take up the arms of faith against a sea of trouble, and your opposition shall yet end your distresses. There is One who careth for you. His eye is fixed on you, his heart beats with pity for your woe, and his hand omnipotent shall yet bring you the needed help. The darkest cloud shall scatter itself in showers of mercy. The blackest gloom shall give place to the morning. He, if thou art one of his family, will bind up thy wounds, and heal thy broken heart. Doubt not his grace because of thy tribulation, but believe that he loveth thee as much in seasons of trouble as in times of happiness. What a serene and quiet life might you lead if you would leave providing to the God of providence! With a little oil in the cruse, and a handful of meal in the barrel, Elijah outlived the famine, and you will do the same. If God cares for you, why need you care too? Can you trust him for your soul, and not for your body? He has never refused to bear your burdens, he has never fainted under their weight. Come, then, soul! have done with fretful care, and leave all thy concerns in the hand of a gracious God. '
}